[
  {
    "name": "Chocolate Cake",
    "description": "A rich and moist chocolate cake with chocolate frosting.",
    "ingredients": ["flour", "sugar", "eggs", "chocolate"],
    "instructions": [
      "Preheat the oven to 350°F (180°C).",
      "In a large mixing bowl, combine the flour, sugar, and eggs.",
      "Melt the chocolate in a microwave-safe bowl or in a double boiler and add it to the mixing bowl.",
      "Pour the batter into a greased 9x13-inch baking pan.",
      "Bake for 30-35 minutes or until a toothpick inserted into the center comes out clean.",
      "Let the cake cool before frosting with chocolate frosting."
    ],
    "url": "img/chocoladecake.png",
    "href": "ChocolateCake.html"
  },
  {
    "name": "Grilled Steak",
    "description": "A juicy and flavorful steak cooked to perfection on the grill.",
    "ingredients": ["steak", "salt", "pepper", "olive oil", "garlic"],
    "instructions": [
    "Preheat the grill to high heat.",
    "Sprinkle the steak with salt and pepper on both sides.",
    "Brush the steak with olive oil and press minced garlic onto the steak.",
    "Grill the steak for 4-5 minutes per side for medium-rare, or longer for desired doneness.",
    "Let the steak rest for a few minutes before slicing and serving."
    ],
    "url": "img/grilledsteak.png",
    "href": "GrilledSteak.html"
    },
  {
    "name": "Pepperoni Pizza",
    "description": "A classic pizza with a crispy crust and loaded with pepperoni and mozzarella cheese.",
    "ingredients": ["pizza dough", "tomato sauce", "mozzarella cheese", "pepperoni"],
    "instructions": [
    "Preheat the oven to 425°F (220°C).",
    "Roll out the pizza dough to desired thickness and place on a greased baking sheet.",
    "Spread tomato sauce evenly over the dough, leaving a small border for the crust.",
    "Sprinkle mozzarella cheese and pepperoni over the sauce.",
    "Bake for 15-20 minutes or until the crust is golden brown and the cheese is melted and bubbly.",
    "Remove from the oven and let cool for a few minutes before slicing and serving."
    ],
    "url": "img/pepperonipizza.png",
    "href": "PepperoniPizza.html"
    },
    {
      "name": "Spaghetti Bolognese",
      "description": "A traditional Italian dish made with spaghetti, meat sauce, and grated parmesan cheese.",
      "ingredients": ["spaghetti", "ground beef", "tomato sauce", "onion", "garlic", "carrots", "oregano", "parmesan cheese"],
      "instructions": [
      "Bring a large pot of salted water to a boil and cook the spaghetti according to package instructions.",
      "In a separate pan, brown the ground beef over medium heat until fully cooked.",
      "Add diced onion, minced garlic, and grated carrots to the pan and cook for a few minutes.",
      "Add the tomato sauce and oregano and simmer for 10-15 minutes.",
      "Drain the cooked spaghetti and add it to the meat sauce.",
      "Toss until the spaghetti is coated with the sauce.",
      "Serve with grated parmesan cheese on top."
      ],
      "url": "img/SpaghettiBolognese.png",
      "href": "SpaghettiBolognese.html"
      },
    {
      "name": "Classic Grilled Cheese",
      "description": "A simple yet delicious sandwich made with toasted bread and melted cheese.",
      "ingredients": ["bread", "butter", "cheddar cheese"],
      "instructions": [
      "Butter one side of each slice of bread.",
      "Place a slice of cheddar cheese between the two slices of bread, buttered side out.",
      "In a pan over medium heat, grill the sandwich until the bread is toasted and the cheese is melted.",
      "Remove from the pan and let cool for a few minutes before slicing and serving."
      ],
      "url": "img/grilledcheese.png",
      "href": "ClassicGrilledCheese.html"
      },
    {
      "name": "Tofu Stir Fry",
      "description": "A flavorful and healthy dish made with crispy tofu and a variety of vegetables.",
      "ingredients": ["tofu", "soy sauce", "cornstarch", "vegetable oil", "bell peppers", "onion", "carrots", "ginger", "garlic"],
      "instructions": [
      "Drain the tofu and press out any excess water.",
      "Cut the tofu into cubes and toss with soy sauce and cornstarch.",
      "In a pan or wok, heat the vegetable oil over high heat.",
      "Add the tofu and cook until crispy, about 5 minutes.",
      "Remove the tofu from the pan and set aside.",
      "In the same pan, add diced bell peppers, onion, and grated carrots. Sauté for 2-3 minutes.",
      "Add minced ginger and garlic and sauté for an additional minute.",
      "Return the tofu to the pan and toss with the vegetables to combine.",
      "Serve with rice or noodles."
      ],
      "url": "img/tofustirfry.png",
      "href": "TofuStirFry.html"
      },
    {
      "name": "Sesame Noodles",
      "description": "A savory and satisfying dish made with noodles, vegetables and a delicious sesame sauce.",
      "ingredients": ["linguine noodles", "carrots", "bell peppers", "green onions", "sesame oil", "soy sauce", "ginger", "garlic", "sesame seeds"],
      "instructions": [
      "Cook the linguine noodles according to package instructions.",
      "Drain and rinse the noodles in cold water to stop the cooking process.",
      "In a pan or wok, heat sesame oil over medium heat.",
      "Add sliced carrots, bell peppers and green onions. Sauté for 2-3 minutes.",
      "Add minced ginger and garlic, sauté for an additional minute.",
      "Add the cooked noodles to the pan and toss to combine.",
      "In a small bowl, mix together soy sauce, sesame oil, and a tablespoon of sesame seeds.",
      "Add the sauce to the pan and toss until the noodles are well coated.",
      "Serve warm, garnished with extra sesame seeds and green onions."
      ],
      "url": "img/sesamenoodles.png",
      "href": "SesameNoodles.html"
      },
      {
        "name": "Lemon Chicken",
        "description": "Een tangy en smaakvol gerecht gemaakt met kipfilets en een citroenbotersaus.",
        "ingredients": ["kipfilets", "bloem", "zout", "peper", "boter", "citroensap", "peterselie"],
        "instructions": [
        "Hak de kip in bloemmengsel",
        "Bak het in een pan met boter",
        "Maak de citroenbotersaus en giet het bovenop"
        ],
        "url": "img/lemonherbchicken.png",
        "href": "LemonChicken.html"
      },
      {
        "name": "Vegetable Stir-Fry",
        "description": "Een gezonde en heerlijke maaltijd gemaakt met een verscheidenheid aan groenten en uw keuze aan eiwit.",
        "ingredients": ["groenten", "eiwit", "stoofpot saus"],
        "instructions": [
        "Kook het eiwit in een pan",
        "Voeg de groenten en de saus toe",
        "Kook tot de groenten gaar zijn"
        ],
        "url": "img/vegetablestirfry.png",
        "href": "VegetableStirFry.html"
        },
        {
          "name": "Sushirolls",
          "description": "Een klassiek Japans gerecht gemaakt met sushi rijst, zeewier en diverse vullingen",
          "ingredients": ["sushi rijst", "zeewier", "vullingen", "sojasaus", "wasabi"],
          "instructions": [
          "Maak de sushi rijst",
          "Plaats de vullingen in het midden van de zeewiersheet",
          "Rol het op met behulp van een bamboemat"
          ],
          "url": "img/sushirolls.png",
          "href": "SushiRolls.html"
          },
        {
          "name": "Shrimp Tacos",
          "description": "A popular Mexican dish made with grilled shrimp and a variety of toppings.",
          "ingredients": ["shrimp", "oil", "spices", "tortillas", "toppings"],
          "instructions": [
          "Marinate the shrimp in oil and spices",
          "Grill them",
          "Serve them in warm tortillas with toppings"
          ],
          "url": "img/shrimptacos.png",
          "href": "ShrimpTacos.html"
          },
          {
            "name": "Romige tomatensoep",
          "description": "Een klassiek comfort food gemaakt met tomaten, room en kruiden.",
          "ingredients": ["blik tomaten", "room", "ui", "knoflook", "kruiden"],
          "instructions": [
          "Ui en knoflook fruiten",
          "Blik tomaten, room en kruiden toevoegen",
          "Koken tot de soep warm is"
          ],
          "url": "img/tomatosoup.png",
          "href": "TomatoSoup.html"
        }
]
